[Hero_test.A_Sanctuary_Warrior_Ice_Balanced H7HeroClass]
mName="寒冰战士"

[Skill_rang_novice_roue_des_talent.A_humidite_allie_Buff H7BaseBuff]
mName="潮湿"
mTooltip="生物承受额外的 %res1 气系 %icon_air 和水系 %icon_water 伤害。"

[Skill_rang_expert_roue_des_talent.A_Bulle_d_eau_combat_warfare_Buff H7BaseBuff]
mName="水泡术"
mTooltip="此生物被包裹在一个水泡中，该水泡能吸收其遭受的第一次攻击的 %special.val3 伤害。此生物获得 %buff1.buff.stat1 攻击 %icon_attack 和防御 %icon_defense 加成。"

[Skill_rang_expert_roue_des_talent.A_karma_allie_Buff H7BaseBuff]
mName="业报"
mTooltip=""

[Skill_Rang_grand_maitre_roue_talent.A_Cleave_honneur H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="神社荣耀"
mTooltip="只要此生物被水泡术包围：对尚未被攻击过的目标（拥有可敬对手增益）造成额外伤害。"

[Skill_rang_expert_roue_des_talent.A_warfare_Buff H7BaseBuff]
mName="战争增益"
mTooltip=""

[Skill_Rang_grand_maitre_roue_talent.A_Honneur_du_sanctuaire_Buff H7BaseBuff]
mName="神社荣耀"
mTooltip="只要此生物被水泡术包裹：对其目标造成其攻击力2倍的伤害，如果该目标尚未被攻击过（拥有可敬对手增益）。"

[Skill_rang_expert_roue_des_talent.A_LightningBolt H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战争水泡"
mTooltip="战争机器有50%的几率被 %spell1.name 包裹。\n%spell1.name 吸收伤害。此外，只要被 %spell1.name 包裹，该水泡还能增加 %buff1.buff.buff1.buff.stat1 攻击 %icon_attack 和防御 %icon_defense。"

[Skill_Rang_grand_maitre_roue_talent.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="圣堂荣耀"
mTooltip="敌方单位在每回合开始时获得：%spell1.name。友方生物对标记有 %spell1.name 的目标造成额外伤害，前提是它们被包裹在水泡术中。当目标在战斗回合中首次受到伤害时，%spell1.name 被驱散。"

[Skill_Rang_grand_maitre_roue_talent.A_creature_honorable_Buff H7BaseBuff]
mName="可敬对手"
mTooltip="只要此生物在本回合未受到伤害，即被视为诚实的对手。"

[Skill_rang_novice_roue_des_talent.A_humidite_Buff H7BaseBuff]
mName="潮湿"
mTooltip="生物承受额外的 %res1 气系 %icon_air 和水系 %icon_water 伤害。"

[Skill_rang_novice_roue_des_talent.A_ArcaneChanneling_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="完美水泡"
mTooltip="被 %spell2.name 包裹的生物获得 %buff1.buff.stat %icon_luck 幸运直到回合结束，或直到 %spell2.name 被移除。"

[Skill_faction.A_Bulle_d_eau_maitre_description H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="水泡术"
mTooltip="友方生物在每回合战斗开始时，有75%的几率获得 %spell.name。"

[Skill_faction.A_Bulle_d_eauy_expert_description H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="水泡术"
mTooltip="友方生物在每回合战斗开始时，有50%的几率获得 %spell.name。"

[Skill_faction.A_Bulle_d_eau_combat_elite_Buff H7BaseBuff]
mName="水泡术"
mTooltip="此生物被包裹在一个水泡中，该水泡能吸收其遭受的第一次攻击的 %special.val3 伤害。此生物对标记有 %spell.4name 的敌人造成 %d 额外伤害。"

[Skill_rang_novice_roue_des_talent.A_ArcaneCatalyst_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="溅射"
mTooltip="如果友方生物被 %spell1.name 包裹，相邻的攻击者会获得 %spell2.name，持续 %buff2.buff.buff.buff.durini 回合。"

[Skill_faction.A_Bulle_d_eau_creature_expert_Buff H7BaseBuff]
mName="水泡术"
mTooltip=""

[Skill_rang_master_roue_des_talent.A_ArcaneAttunement_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="毁灭水泡"
mTooltip="被 %spell4.name 包裹的近战生物，其造成的伤害获得 %buff1.buff.stat1 提升，直到回合结束，或直到 %spell4.name 被移除。"

[Skill_faction.A_Bulle_d_eau_creature_master_Buff H7BaseBuff]
mName="水泡术"
mTooltip=""

[Skill_rang_expert_roue_des_talent.A_karma_Buff H7BaseBuff]
mName="业报"
mTooltip="该生物在 %durnow 回合内获得 %stat1 %stat1.icon 和 %stat2 %stat2.icon。"

[Skill_faction.A_Bulle_d_eau_combat_Buff H7BaseBuff]
mName="水泡术"
mTooltip="此生物被包裹在一个水泡中，该水泡能吸收其遭受的第一次攻击的 %special.val3 伤害。此生物对被 %spell4.name 标记的敌人造成 %d 额外伤害。"

[Skill_rang_master_roue_des_talent.A_Bulle_devastation_Buff H7BaseBuff]
mName="毁灭水泡"
mTooltip=""

[Skill_faction.A_Bulle_d_eau_creature_novice_Buff H7BaseBuff]
mName="水泡术"
mTooltip=""

[Skill_rang_novice_roue_des_talent.A_Bulle_parfaite_Buff H7BaseBuff]
mName="完美水泡"
mTooltip="生物获得 %stat %icon.stat 直到回合结束。"

[Skill_rang_novice_roue_des_talent.A_bulle_electrique_Buff H7BaseBuff]
mName="闪电水泡"
mTooltip="在战斗回合结束时，对相邻敌人造成 %d 伤害 %icon_air。"

[Skill_rang_novice_roue_des_talent.A_ArcaneShield_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="闪电水泡"
mTooltip="被 %spell1.name 包裹的生物在下一战斗回合开始时获得 %spell3.name。（在每个生物的回合结束时，被 %spell3.name 包裹的友方单位对相邻敌人造成 %icon_air 伤害。伤害值随英雄等级变化。如果友方生物受到伤害，%spell3.name 消散。）"

[Skill_faction.A_Bulle_d_eauy_novice_description H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="水泡术"
mTooltip="友方生物在每回合战斗开始时，有25%的几率获得 %spell.name。"

[Skill_faction.Metamagic_skill H7Skill]
mDescriptions[0]="友方生物有机会被 %spell1.name 包裹，该水泡能吸收伤害。%spell1.name 持续到回合结束或友方生物受到伤害。"

mDescriptions[1]="友方生物有机会被 %spell1.name 包裹，该水泡能吸收伤害。%spell1.name 持续到回合结束或友方生物受到伤害。"

mDescriptions[2]="友方生物在每回合开始时，有25%的几率被 %spell1.name 包裹。%spell1.name 持续到回合结束或友方生物受到伤害。"

mDescriptions[3]="友方生物在每回合开始时，有50%的几率被 %spell1.name 包裹。%spell1.name 持续到回合结束或友方生物受到伤害。"

mDescriptions[4]="友方生物在每回合开始时，有75%的几率被 %spell1.name 包裹。%spell1.name 持续到回合结束或友方生物受到伤害。"

mName="水占术"
mTooltip="瀛洲阵营技能"

[Skill_rang_expert_roue_des_talent.A_ArcaneBrillance_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="业报"
mTooltip="如果友方生物被 %spell1.name 包裹，攻击者会获得 %spell2.name，持续 %buff2.buff.buff.buff.durini 回合。"

[Skill_faction.A_Bulle_d_eau_combat_champion_Buff H7BaseBuff]
mName="水泡术"
mTooltip="此生物被包裹在一个水泡中，该水泡能吸收其遭受的第一次攻击的 %special.val3 伤害。此生物对被 %spell4.name 标记的敌人造成 %d 额外伤害。"